{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "[^ATCG]"
        },
        "content": ""
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[CLS]": 0,
      "[SEP]": 1,
      "[PAD]": 2,
      "[MASK]": 3,
      "[UNK]": 4,
      "A": 5,
      "C": 6,
      "G": 7,
      "T": 8,
      "TT": 9,
      "AA": 10,
      "TG": 11,
      "CA": 12,
      "TC": 13,
      "GG": 14,
      "TA": 15,
      "CC": 16,
      "GA": 17,
      "AAA": 18,
      "GC": 19,
      "TCA": 20,
      "TGA": 21,
      "TAA": 22,
      "GTT": 23,
      "CTT": 24,
      "CTG": 25,
      "CAA": 26,
      "GTG": 27,
      "GAA": 28,
      "CACA": 29,
      "TTA": 30,
      "GCA": 31,
      "TGTG": 32,
      "CTC": 33,
      "GGA": 34,
      "TTTT": 35,
      "GTC": 36,
      "CCA": 37,
      "GCC": 38,
      "GTA": 39,
      "TAAA": 40,
      "AAAA": 41,
      "CTA": 42,
      "TGTT": 43,
      "CAAA": 44,
      "TATT": 45,
      "TCTC": 46,
      "GAGA": 47,
      "TGAA": 48,
      "GAAA": 49,
      "CATT": 50,
      "CAGA": 51,
      "CGA": 52,
      "TCTT": 53,
      "CGG": 54,
      "TATA": 55,
      "TCTG": 56,
      "CTGA": 57,
      "GTGA": 58,
      "GCTG": 59,
      "GTCA": 60,
      "CTCA": 61,
      "TCAA": 62,
      "CAGG": 63,
      "CATG": 64,
      "GCTT": 65,
      "GAGG": 66,
      "CCTT": 67,
      "GTTA": 68,
      "GTAA": 69,
      "CCTG": 70,
      "CTAA": 71,
      "GATT": 72,
      "GCAA": 73,
      "TACA": 74,
      "TCCA": 75,
      "GGGG": 76,
      "CCAA": 77,
      "CACACACA": 78,
      "TATG": 79,
      "TGTGTGTG": 80,
      "GATG": 81,
      "TTAA": 82,
      "GGAA": 83,
      "CCCC": 84,
      "TTTG": 85,
      "TAAAA": 86,
      "GACA": 87,
      "GAAAA": 88,
      "GCTC": 89,
      "CCTC": 90,
      "GGTT": 91,
      "CTTA": 92,
      "CGTG": 93,
      "CAAAA": 94,
      "GCCA": 95,
      "GGTG": 96,
      "TTTA": 97,
      "CGTT": 98,
      "TTCA": 99,
      "CGC": 100,
      "TGCA": 101,
      "CGTC": 102,
      "TCTA": 103,
      "CCCA": 104,
      "TGTA": 105,
      "TCAAA": 106,
      "TTATT": 107,
      "GATA": 108,
      "GTTTT": 109,
      "CTTTT": 110,
      "TCCC": 111,
      "CTGAA": 112,
      "TGGA": 113,
      "CGGA": 114,
      "GGCA": 115,
      "TCATT": 116,
      "CGCA": 117,
      "GCACA": 118,
      "TGTC": 119,
      "CCACA": 120,
      "GGGA": 121,
      "CTGTT": 122,
      "CATA": 123,
      "GTGAA": 124,
      "TGATT": 125,
      "GTAAA": 126,
      "TAATT": 127,
      "TCACA": 128,
      "TAGA": 129,
      "GTGTT": 130,
      "TGAAA": 131,
      "GCAAA": 132,
      "CAACA": 133,
      "CGCC": 134,
      "TGACA": 135,
      "TCCTC": 136,
      "CTGCA": 137,
      "CCAAA": 138,
      "GCTA": 139,
      "CGAA": 140,
      "TTTTTT": 141,
      "GAGGA": 142,
      "TGGG": 143,
      "GCTGA": 144,
      "CACACACACACACACA": 145,
      "TCTGA": 146,
      "CTAAA": 147,
      "GGCC": 148,
      "TCTCA": 149,
      "CTGTG": 150,
      "GGAAA": 151,
      "TGTGTGTGTGTGTGTG": 152,
      "TCCTT": 153,
      "TTACA": 154,
      "CGTA": 155,
      "CTCTT": 156,
      "TCAGA": 157,
      "TGATG": 158,
      "CTCTG": 159,
      "CTTCA": 160,
      "GAGAA": 161,
      "GCTCA": 162,
      "GTTAA": 163,
      "GGTA": 164,
      "CAATT": 165,
      "TAAAAA": 166,
      "TCCTG": 167,
      "GACC": 168,
      "TAACA": 169,
      "GTCAA": 170,
      "GCGG": 171,
      "CTCAA": 172,
      "GTTTG": 173,
      "TAATG": 174,
      "CCTCA": 175,
      "GTGTG": 176,
      "AAAAAA": 177,
      "TATC": 178,
      "CTTTG": 179,
      "CTGTA": 180,
      "GCAGA": 181,
      "CTCCA": 182,
      "TAATA": 183,
      "GCGA": 184,
      "GTCTT": 185,
      "CTTAA": 186,
      "GGTC": 187,
      "GAATT": 188,
      "TTATA": 189,
      "GTTCA": 190,
      "CTTTA": 191,
      "CCATT": 192,
      "GCATT": 193,
      "CCTA": 194,
      "CAAAAA": 195,
      "TGAGA": 196,
      "GTATT": 197,
      "GAACA": 198,
      "GCCAA": 199,
      "GAAAAA": 200,
      "TTTTAA": 201,
      "GTGCA": 202,
      "GTTTA": 203,
      "CAATG": 204,
      "GTCTG": 205,
      "TGAGG": 206,
      "TCATG": 207,
      "CAATA": 208,
      "TTATG": 209,
      "TCATA": 210,
      "TCGA": 211,
      "CACC": 212,
      "CGTCA": 213,
      "GGAGA": 214,
      "GGAGG": 215,
      "GCAGG": 216,
      "CTGGA": 217,
      "CTATT": 218,
      "TCCCA": 219,
      "TGTGTT": 220,
      "GGATT": 221,
      "CCTGA": 222,
      "GAAGA": 223,
      "CAAGA": 224,
      "GGACA": 225,
      "CACACA": 226,
      "GCCTT": 227,
      "TCGG": 228,
      "TGATA": 229,
      "GTGGA": 230,
      "CCGA": 231,
      "CTACA": 232,
      "TCAGG": 233,
      "CCCTC": 234,
      "TGTGAA": 235,
      "TCTTTT": 236,
      "TATATATA": 237,
      "TAGG": 238,
      "TCTCTCTC": 239,
      "CGCTG": 240,
      "GCCTG": 241,
      "AAACA": 242,
      "TCCAA": 243,
      "GTCCA": 244,
      "CCAGA": 245,
      "TAATAA": 246,
      "CTGCTG": 247,
      "GGGTT": 248,
      "TGTGTG": 249,
      "TTATTA": 250,
      "GCAGCA": 251,
      "GAGAGAGA": 252,
      "GAATA": 253,
      "CCCTG": 254,
      "AAATT": 255,
      "GTTGA": 256,
      "GTGTA": 257,
      "GAATG": 258,
      "GTACA": 259,
      "TAAGA": 260,
      "CCCTT": 261,
      "CTCCTC": 262,
      "GTAAAA": 263,
      "GGATG": 264,
      "TTAGA": 265,
      "CCGG": 266,
      "AAATG": 267,
      "CAAACA": 268,
      "CGTGA": 269,
      "GCAGC": 270,
      "GGAGGA": 271,
      "CTTGA": 272,
      "CAACAA": 273,
      "TTAGG": 274,
      "TTTTCA": 275,
      "CCATG": 276,
      "TCAAAA": 277,
      "GCATG": 278,
      "TATTAA": 279,
      "TCTGTT": 280,
      "TCTAA": 281,
      "CCAGG": 282,
      "AAATA": 283,
      "GAAGG": 284,
      "TCATCA": 285,
      "TCTTA": 286,
      "TTTTTA": 287,
      "GTTGTT": 288,
      "GCTAA": 289,
      "TATTTA": 290,
      "CAAGG": 291,
      "CACATT": 292,
      "CCCTAA": 293,
      "CGAGA": 294,
      "GTGGG": 295,
      "TCTGTG": 296,
      "TAAATA": 297,
      "TGTTTG": 298,
      "CAGGAA": 299,
      "CATTAA": 300,
      "TTTTTG": 301,
      "GTGAAA": 302,
      "CAGC": 303,
      "CCCCA": 304,
      "TCTGAA": 305,
      "CTGGG": 306,
      "TTGA": 307,
      "GAAGAA": 308,
      "TGATGA": 309,
      "GAGGAA": 310,
      "CTTCTT": 311,
      "CTGAAA": 312,
      "GTTGG": 313,
      "TGTTAA": 314,
      "CAGCA": 315,
      "CTTGG": 316,
      "TAAATT": 317,
      "GAGC": 318,
      "TTTTTTTT": 319,
      "CATCA": 320,
      "TCTCTG": 321,
      "TCTCTT": 322,
      "CTAAAA": 323,
      "CTATA": 324,
      "TAAAAAA": 325,
      "GATGA": 326,
      "GCAAAA": 327,
      "CACAA": 328,
      "GTTATT": 329,
      "TAAATG": 330,
      "CAAATT": 331,
      "TCCATT": 332,
      "TATTA": 333,
      "GCTGTT": 334,
      "GCTGTG": 335,
      "GTTAGG": 336,
      "TCACC": 337,
      "CAGTT": 338,
      "CAGAA": 339,
      "CACTG": 340,
      "TGACC": 341,
      "CGCTT": 342,
      "CTCTA": 343,
      "CTTCC": 344,
      "CAGTG": 345,
      "CTATG": 346,
      "GTATG": 347,
      "TGAATT": 348,
      "TATTTG": 349,
      "GGCTG": 350,
      "CACAGA": 351,
      "GTCAAA": 352,
      "TACAA": 353,
      "GCTTTT": 354,
      "GCTCTG": 355,
      "CTTTTTT": 356,
      "TCAGTG": 357,
      "GTAGA": 358,
      "CGAAA": 359,
      "GTATA": 360,
      "CATC": 361,
      "TCACAA": 362,
      "TCAGCA": 363,
      "CACTT": 364,
      "TAAGG": 365,
      "CAAATG": 366,
      "CCAAAA": 367,
      "GCTGAA": 368,
      "CATTTA": 369,
      "GACAA": 370,
      "TCCTCA": 371,
      "CCCAA": 372,
      "TCACTG": 373,
      "GAAATG": 374,
      "GAGTT": 375,
      "GAGCA": 376,
      "TATTTT": 377,
      "TCAGTT": 378,
      "GGTGA": 379,
      "TTATTTT": 380,
      "CAGATT": 381,
      "TCATC": 382,
      "TCTCAA": 383,
      "CATTTG": 384,
      "CTCTC": 385,
      "CGTTA": 386,
      "TCTTTG": 387,
      "CAATAA": 388,
      "CTGCC": 389,
      "CAAATA": 390,
      "CGCTC": 391,
      "CCATA": 392,
      "CTGATT": 393,
      "TAAACA": 394,
      "GCTTA": 395,
      "CTCAAA": 396,
      "GACTT": 397,
      "GCGTG": 398,
      "CGGTG": 399,
      "TGTTTA": 400,
      "CTCCC": 401,
      "TCACTT": 402,
      "CGGAA": 403,
      "CAGGA": 404,
      "GAAAAAA": 405,
      "GCCACA": 406,
      "CTGTGA": 407,
      "TATATA": 408,
      "CTGTC": 409,
      "TAATTA": 410,
      "CTCATT": 411,
      "GAAATT": 412,
      "GCATA": 413,
      "CGGTT": 414,
      "CCTTTT": 415,
      "GGGGGGGG": 416,
      "GTTAAA": 417,
      "TAATGA": 418,
      "CGTAA": 419,
      "CCTCTG": 420,
      "GATC": 421,
      "CCCCCCCC": 422,
      "GCCTC": 423,
      "GTCTA": 424,
      "GCCCA": 425,
      "GGTCA": 426,
      "GTTTTA": 427,
      "TGAATG": 428,
      "GATTAA": 429,
      "TCTTAA": 430,
      "GAAACA": 431,
      "CCACC": 432,
      "CAGACA": 433,
      "CGCAA": 434,
      "GGGAA": 435,
      "GCGGA": 436,
      "GCGTT": 437,
      "TGAGTG": 438,
      "GCGTC": 439,
      "TCTCCA": 440,
      "GTCATT": 441,
      "CACATG": 442,
      "GGGGA": 443,
      "CTTTTA": 444,
      "CAGATG": 445,
      "GAAATA": 446,
      "GTGTC": 447,
      "GTTTCA": 448,
      "GGAAAA": 449,
      "GACTG": 450,
      "GTGATT": 451,
      "CTGATG": 452,
      "TGACTT": 453,
      "TATTCA": 454,
      "GCTGCA": 455,
      "CGACA": 456,
      "CGATG": 457,
      "CGCCA": 458,
      "CAGGTT": 459,
      "CGATT": 460,
      "TGAGGA": 461,
      "GTTTC": 462,
      "GTCTC": 463,
      "TGACAA": 464,
      "GCCCC": 465,
      "GGCTT": 466,
      "CTGTCA": 467,
      "CCACCA": 468,
      "TCAATT": 469,
      "CAAAGA": 470,
      "GTGATG": 471,
      "GCTCTT": 472,
      "CAACC": 473,
      "GTGGTG": 474,
      "CTCTGA": 475,
      "TAATC": 476,
      "GCAGGA": 477,
      "CTTATT": 478,
      "TGTGTA": 479,
      "TCATTA": 480,
      "GAGTG": 481,
      "TGAATA": 482,
      "TAACAA": 483,
      "GTTTGA": 484,
      "CTGCTT": 485,
      "GCCAAA": 486,
      "TCAGAA": 487,
      "TCAACA": 488,
      "CCTTTG": 489,
      "TGAGAA": 490,
      "CGCACA": 491,
      "GCAGAA": 492,
      "GCAGTG": 493,
      "GAGATG": 494,
      "CCTCTT": 495,
      "CTGACA": 496,
      "GCGC": 497,
      "TACTT": 498,
      "AAAAAAA": 499,
      "TAACTT": 500,
      "TTAATT": 501,
      "GGCCA": 502,
      "GAGAGA": 503,
      "CCCGA": 504,
      "TAAAGA": 505,
      "CATTCA": 506,
      "TCTGCA": 507,
      "CCTCTC": 508,
      "TGTTCA": 509,
      "GTTGTG": 510,
      "TGATC": 511,
      "GGATA": 512,
      "CTGCTC": 513,
      "TGTGCA": 514,
      "TTATC": 515,
      "AAAGA": 516,
      "TGAACA": 517,
      "TCACCA": 518,
      "TAACC": 519,
      "CTTGTT": 520,
      "GGAGAA": 521,
      "CAGAGG": 522,
      "TCTTTA": 523,
      "CGAGG": 524,
      "AAAATG": 525,
      "GTAATT": 526,
      "GCTCCA": 527,
      "GTCTGA": 528,
      "TTACTT": 529,
      "TTACAA": 530,
      "TCCACA": 531,
      "CCTGTT": 532,
      "TCCTA": 533,
      "CCTGTG": 534,
      "TCAATG": 535,
      "TAATCA": 536,
      "TCTTCA": 537,
      "CTTAAA": 538,
      "CTCACA": 539,
      "GGCTC": 540,
      "TCTGTA": 541,
      "GTTTTTT": 542,
      "GTGTGA": 543,
      "GTCCC": 544,
      "GATCA": 545,
      "CATGTA": 546,
      "CTCTCA": 547,
      "CATGCA": 548,
      "GAACAA": 549,
      "GCTTTG": 550,
      "TTAGTG": 551,
      "CCAGCA": 552,
      "GAGATT": 553,
      "GCTCTC": 554,
      "TGAAGA": 555,
      "CTTGTG": 556,
      "CTTTCA": 557,
      "TTTTGA": 558,
      "CCTTCA": 559,
      "CCACAA": 560,
      "GATTTG": 561,
      "CTAATT": 562,
      "CCCTAACCCTAA": 563,
      "CTTTC": 564,
      "GGGGAA": 565,
      "CCTTA": 566,
      "CCAGTG": 567,
      "GTGACA": 568,
      "CCACTG": 569,
      "GAGACA": 570,
      "CAAAAAA": 571,
      "TCAATA": 572,
      "TGACTG": 573,
      "GTCACA": 574,
      "GTTGAA": 575,
      "CAGGTG": 576,
      "GCAGCC": 577,
      "CCTGCA": 578,
      "GAGAGG": 579,
      "TATACA": 580,
      "TCAGGA": 581,
      "CTTCTC": 582,
      "TGAAAAA": 583,
      "GAAAGA": 584,
      "TAAGAA": 585,
      "TTACTG": 586,
      "GATTTA": 587,
      "CCATC": 588,
      "CACATA": 589,
      "GCACC": 590,
      "TATATG": 591,
      "TAAAGG": 592,
      "TGTTGA": 593,
      "GTTTAA": 594,
      "TCATGA": 595,
      "GTGCTG": 596,
      "GCGCC": 597,
      "CGGCA": 598,
      "CTTTGA": 599,
      "CCTTAA": 600,
      "GCGAA": 601,
      "CTCCTG": 602,
      "TCAAGA": 603,
      "CCTAA": 604,
      "GCAACA": 605,
      "CTTTAA": 606,
      "TTATCA": 607,
      "AAAACA": 608,
      "GTAGAA": 609,
      "GTAGG": 610,
      "GT": 611,
      "GCATC": 612,
      "CGGGG": 613,
      "GAAAAAAA": 614,
      "GTCATG": 615,
      "CT": 616,
      "CCTCCA": 617,
      "GCACAA": 618,
      "GTTCTG": 619,
      "CGTTTT": 620,
      "TACATA": 621,
      "GTACAA": 622,
      "TATTGA": 623,
      "TATGTA": 624,
      "CAGATA": 625,
      "TCATTTT": 626,
      "GCTTCA": 627,
      "CTTGAA": 628,
      "TCCAAA": 629,
      "CCGTG": 630,
      "CCTGAA": 631,
      "GTCGA": 632,
      "GCCATT": 633,
      "GGTTA": 634,
      "CGTGTT": 635,
      "GAGGTT": 636,
      "GTCAGA": 637,
      "CTGAGA": 638,
      "CTTCTG": 639,
      "GCAGTT": 640,
      "TGTGGA": 641,
      "GCCTA": 642,
      "TAACTG": 643,
      "GCCATG": 644,
      "GGCAA": 645,
      "CCAACA": 646,
      "GCCGA": 647,
      "TTATGA": 648,
      "GTTAGGGTT": 649,
      "TTTTAAA": 650,
      "CTAGA": 651,
      "AAAAAAAA": 652,
      "CCCACA": 653,
      "CTACAA": 654,
      "TTATAA": 655,
      "GCTTAA": 656,
      "GCTCAA": 657,
      "CCGTC": 658,
      "GTGGAA": 659,
      "GCCAGA": 660,
      "CTAATG": 661,
      "TCAGTC": 662,
      "GAGGTG": 663,
      "AAAATA": 664,
      "CCAGAA": 665,
      "TCGTC": 666,
      "TGAGCA": 667,
      "TGAGTT": 668,
      "GCGCA": 669,
      "CCCTCA": 670,
      "TTAGTT": 671,
      "GCTGTA": 672,
      "CTGAGG": 673,
      "GCTAAA": 674,
      "CCAGGA": 675,
      "AAAGG": 676,
      "TATATATATATATATA": 677,
      "GTGTCA": 678,
      "CCATCA": 679,
      "CTGTAA": 680,
      "CCCTA": 681,
      "GCCAGG": 682,
      "CTTCAA": 683,
      "GCCGG": 684,
      "CGTGTG": 685,
      "TCTATT": 686,
      "CTGATA": 687,
      "CCTTTA": 688,
      "AAAATT": 689,
      "CTCGG": 690,
      "GAAGGA": 691,
      "CG": 692,
      "CTCAGA": 693,
      "GTTCAA": 694,
      "GTGTTTT": 695,
      "GCTTTA": 696,
      "CTGCAA": 697,
      "CTCATG": 698,
      "GTCGG": 699,
      "GCCTCA": 700,
      "CGTGAA": 701,
      "TCTGGA": 702,
      "GTAATG": 703,
      "GTGAGA": 704,
      "CCCATT": 705,
      "GCACTG": 706,
      "GCAATT": 707,
      "GTGGTT": 708,
      "TCCAGA": 709,
      "CCACTT": 710,
      "CAAAGG": 711,
      "TCTAAA": 712,
      "CACAGG": 713,
      "GCATCA": 714,
      "GTCCTG": 715,
      "TGATAA": 716,
      "CTCCTT": 717,
      "CCAGTT": 718,
      "CCAATT": 719,
      "TCGTT": 720,
      "GTGGGA": 721,
      "TGTGGG": 722,
      "CAATGA": 723,
      "CGATA": 724,
      "TTAATG": 725,
      "GCTGGA": 726,
      "TGTTGG": 727,
      "TATTTTA": 728,
      "CTGGTT": 729,
      "CGGGA": 730,
      "GTCTCA": 731,
      "CCGTT": 732,
      "TGATCA": 733,
      "CCTGTA": 734,
      "GTTACA": 735,
      "TTTTGG": 736,
      "TAAAATG": 737,
      "GTCCTC": 738,
      "CGTCTT": 739,
      "CAAGAA": 740,
      "TGAAGG": 741,
      "TTAGAA": 742,
      "GCTACA": 743,
      "CGTCTG": 744,
      "CTGGAA": 745,
      "CAACTT": 746,
      "GATGGA": 747,
      "CCGCC": 748,
      "CTCGA": 749,
      "CTGGTG": 750,
      "CCCGG": 751,
      "TTAGGGTTAGG": 752,
      "TATTAAA": 753,
      "TGATTA": 754,
      "TCGTG": 755,
      "CCGGA": 756,
      "TTTGTA": 757,
      "TCTTGA": 758,
      "TCCGA": 759,
      "CATGGA": 760,
      "GTTGGTT": 761,
      "GCAATG": 762,
      "GGAATT": 763,
      "GCTATG": 764,
      "CTTCCA": 765,
      "CAAACAA": 766,
      "TTAGCA": 767,
      "TCCTGA": 768,
      "GTGTGTG": 769,
      "TCCCTC": 770,
      "GTGAGG": 771,
      "GTTGTA": 772,
      "TCTGAAA": 773,
      "TCAGCC": 774,
      "TATAA": 775,
      "CATTGA": 776,
      "TCCAGG": 777,
      "TCCCTG": 778,
      "CCTCAA": 779,
      "TCGGA": 780,
      "GTTATG": 781,
      "GTCCAA": 782,
      "TATGCA": 783,
      "TTAAAAA": 784,
      "GCACTT": 785,
      "TTTTCTT": 786,
      "GTTGGA": 787,
      "GTTCTT": 788,
      "GCGTA": 789,
      "CCAATG": 790,
      "TTTGCA": 791,
      "GAATAA": 792,
      "TGTGAAA": 793,
      "TCCCTT": 794,
      "CTGCCA": 795,
      "CAAGTG": 796,
      "CTGGGA": 797,
      "GAAAATG": 798,
      "TCATAA": 799,
      "CAAAATG": 800,
      "TCTCTCTCTCTCTCTC": 801,
      "TCCCCC": 802,
      "TAAAATA": 803,
      "GTAACA": 804,
      "CCCAAA": 805,
      "TCTCTA": 806,
      "TAAATAA": 807,
      "GAAAGG": 808,
      "TCTGTCTG": 809,
      "CTCCAA": 810,
      "CAGACAGA": 811,
      "GCCTGA": 812,
      "GTGATA": 813,
      "TCAGTA": 814,
      "TATTTAA": 815,
      "TTTTGTT": 816,
      "GAGAGAGAGAGAGAGA": 817,
      "GCGCTG": 818,
      "TTAATA": 819,
      "GATTCA": 820,
      "GATAGATA": 821,
      "TTACC": 822,
      "TCTATCTA": 823,
      "TCAAAAA": 824,
      "GAGGGG": 825,
      "CTTACA": 826,
      "CGTCAA": 827,
      "CTACGA": 828,
      "CCTGGA": 829,
      "CAGGGA": 830,
      "TAAGTG": 831,
      "TCCATG": 832,
      "CTCTCTC": 833,
      "TGTTGTT": 834,
      "GAGACTT": 835,
      "GAAGTG": 836,
      "GGAGTT": 837,
      "GGAGCA": 838,
      "CTACTG": 839,
      "TAAAAAAA": 840,
      "GTAATA": 841,
      "GATGCA": 842,
      "GATGTA": 843,
      "TAAAATT": 844,
      "GAGGGA": 845,
      "CAACTG": 846,
      "GTCCTT": 847,
      "TGACCA": 848,
      "GTCATA": 849,
      "CCCTGA": 850,
      "GCTGCTG": 851,
      "GTAAAAA": 852,
      "TACAGTA": 853,
      "CTCCCA": 854,
      "TAAAACA": 855,
      "GCTATT": 856,
      "CTACTT": 857,
      "GAAGCA": 858,
      "GTTGCA": 859,
      "GGGGGG": 860,
      "GCTGAAA": 861,
      "CAGGTA": 862,
      "CAGGCA": 863,
      "GCCCTG": 864,
      "CGAAAA": 865,
      "CCCCTT": 866,
      "TTAACA": 867,
      "CAATCA": 868,
      "TATTCTT": 869,
      "CTAACA": 870,
      "CATTAAA": 871,
      "CAACCA": 872,
      "CAATTA": 873,
      "GTGAAAA": 874,
      "CAAAACA": 875,
      "GATAA": 876,
      "GAGGAAA": 877,
      "GGAATG": 878,
      "CCGAA": 879,
      "TCCATA": 880,
      "GTCAGG": 881,
      "TGTTAAA": 882,
      "CAAGTT": 883,
      "GTGCTT": 884,
      "GGAAAAA": 885,
      "TCGAA": 886,
      "CCGCA": 887,
      "GTATTTT": 888,
      "CTCATA": 889,
      "TCACTC": 890,
      "CTCAGG": 891,
      "CCCAGA": 892,
      "TGACTC": 893,
      "CAAGGA": 894,
      "GTAGTT": 895,
      "GGTTTA": 896,
      "CGGTA": 897,
      "TAATAAA": 898,
      "CGAGGA": 899,
      "TCACACA": 900,
      "CTAATA": 901,
      "TTATTTA": 902,
      "GCACCA": 903,
      "GGGGTT": 904,
      "CGCTA": 905,
      "GTGTAA": 906,
      "GTTATA": 907,
      "GGAACA": 908,
      "GAGAGGA": 909,
      "GAGATA": 910,
      "TCTACA": 911,
      "CAGGAAA": 912,
      "TATGAAA": 913,
      "GTAGTA": 914,
      "CGTAAA": 915,
      "TCCGG": 916,
      "CCCCTG": 917,
      "CTGTTTT": 918,
      "TAAATAAA": 919,
      "TGAATAA": 920,
      "TGTTTTA": 921,
      "TGATTTT": 922,
      "CTACTA": 923,
      "GGTTTT": 924,
      "TATTTCA": 925,
      "GAAAACA": 926,
      "TCGCC": 927,
      "CATGAAA": 928,
      "GAATGA": 929,
      "CTGTTA": 930,
      "CGTTAA": 931,
      "GAGGCA": 932,
      "GAAGTT": 933,
      "CCAAAAA": 934,
      "TATTGTT": 935,
      "GTACTT": 936,
      "CCATGA": 937,
      "TAATTTT": 938,
      "TCAAATT": 939,
      "TTCATA": 940,
      "TATAGA": 941,
      "CACACACACACA": 942,
      "CCTCCTC": 943,
      "CAGAGGA": 944,
      "TGAGTC": 945,
      "CATTTTA": 946,
      "CAGGGG": 947,
      "CGTTTG": 948,
      "GTATTA": 949,
      "CCAATA": 950,
      "GTGTTA": 951,
      "TCAGC": 952,
      "CTGAAAA": 953,
      "GGAAGA": 954,
      "CCATTA": 955,
      "GATGAAA": 956,
      "GCAGTA": 957,
      "GGTAA": 958,
      "GGTGGA": 959,
      "CCTTGA": 960,
      "GCAATA": 961,
      "CCAGCC": 962,
      "CAAACACA": 963,
      "GTGGCA": 964,
      "CTTATG": 965,
      "TATGGA": 966,
      "TGAGCC": 967,
      "GAGAGAA": 968,
      "GGACAA": 969,
      "GAAAATA": 970,
      "CTAGG": 971,
      "TGTGTGTGTGTG": 972,
      "CTATTA": 973,
      "TCGCA": 974,
      "TCAAGG": 975,
      "GCAAAAA": 976,
      "TAAGTT": 977,
      "GTGCAA": 978,
      "TAACCA": 979,
      "CAAAAAAA": 980,
      "CTATGA": 981,
      "TCGTA": 982,
      "TCCTCTT": 983,
      "GTCTGTG": 984,
      "CTTATA": 985,
      "GTCCCA": 986,
      "GTGTGTT": 987,
      "CAAGCA": 988,
      "GAACC": 989,
      "GGATGA": 990,
      "TCTATA": 991,
      "TCTGGG": 992,
      "TCACATT": 993,
      "GCGGTG": 994,
      "GTGCC": 995,
      "GATTA": 996,
      "CAAAATT": 997,
      "GCGTCA": 998,
      "CAAAATA": 999,
      "GCATTA": 1000,
      "CTCTGTG": 1001,
      "CTTGTA": 1002,
      "GCGAGG": 1003,
      "CTATAA": 1004,
      "GTCTTTT": 1005,
      "CCTCTA": 1006,
      "GTGTTTG": 1007,
      "GTTCC": 1008,
      "GGTTCA": 1009,
      "GACATA": 1010,
      "CAAACAAA": 1011,
      "CCAAGA": 1012,
      "CTCTTTT": 1013,
      "CACACACACA": 1014,
      "GAAACAA": 1015,
      "GAATTA": 1016,
      "GAATCA": 1017,
      "GAACTG": 1018,
      "GCTGGG": 1019,
      "CGCGG": 1020,
      "CATTTCA": 1021,
      "AAAAGA": 1022,
      "GTTTGTT": 1023,
      "CAACACA": 1024,
      "GCATGA": 1025,
      "CCCCCA": 1026,
      "GCTCTA": 1027,
      "TTTTTAA": 1028,
      "CTGTGTT": 1029,
      "TTAAA": 1030,
      "CTCTCTG": 1031,
      "GTATAA": 1032,
      "TATTGG": 1033,
      "TCTTCTT": 1034,
      "TAAATGA": 1035,
      "GGGGTG": 1036,
      "CGCAAA": 1037,
      "CGGCC": 1038,
      "GTTCCA": 1039,
      "CTGTGTG": 1040,
      "TCACTA": 1041,
      "GTCAAAA": 1042,
      "GGTGCA": 1043,
      "GAACCA": 1044,
      "CGCTGA": 1045,
      "TTACCA": 1046,
      "TCAAACA": 1047,
      "GAACTT": 1048,
      "TAAGGA": 1049,
      "GCACATT": 1050,
      "CTAAAAA": 1051,
      "CCTAAA": 1052,
      "TCCTCTG": 1053,
      "GTCTCTA": 1054,
      "GCAGCTG": 1055,
      "TCCCCA": 1056,
      "TGTGTGA": 1057,
      "GGAATA": 1058,
      "GTATGA": 1059,
      "TTTGGA": 1060,
      "CGAGCTT": 1061,
      "TCTCAAA": 1062,
      "GTTGTC": 1063,
      "TCTCCTC": 1064,
      "TTACATT": 1065,
      "CCACTA": 1066,
      "CGTGCA": 1067,
      "TAAACAA": 1068,
      "CTGGCA": 1069,
      "TTATATT": 1070,
      "TAACTA": 1071,
      "TGTTTGA": 1072,
      "CCAGC": 1073,
      "TAATTAA": 1074,
      "GAATC": 1075,
      "GATTGA": 1076,
      "GAAAATT": 1077,
      "GCCGCC": 1078,
      "TTATTAA": 1079,
      "TCAAATG": 1080,
      "GCTTGA": 1081,
      "TAATATT": 1082,
      "GTGGTA": 1083,
      "GATTAAA": 1084,
      "CACACAA": 1085,
      "TGTTTCA": 1086,
      "TCTGCTG": 1087,
      "GAAAGAA": 1088,
      "CAGAGAA": 1089,
      "CTAATGTG": 1090,
      "GCGAGA": 1091,
      "TTATTTG": 1092,
      "TCTTGG": 1093,
      "CTTGGA": 1094,
      "GTATCA": 1095,
      "GCAAGA": 1096,
      "TAACTC": 1097,
      "TGATGAA": 1098,
      "GGAAGTTGGTT": 1099,
      "CCCCAA": 1100,
      "CTATTTT": 1101,
      "CTGAATT": 1102,
      "TGACAAA": 1103,
      "TGAAATG": 1104,
      "CAACAAA": 1105,
      "CGCCTG": 1106,
      "GCCCTC": 1107,
      "GGAGGAA": 1108,
      "CGGCGG": 1109,
      "GCAGAGA": 1110,
      "TGTGTGTGTG": 1111,
      "TAATGTT": 1112,
      "GTTCTC": 1113,
      "CCTGCTG": 1114,
      "CCTGAAA": 1115,
      "GCATTTT": 1116,
      "GCTGCTT": 1117,
      "GTTAGGGTTGTGA": 1118,
      "CATTGG": 1119,
      "CGCCAA": 1120,
      "GCTCGG": 1121,
      "TGCATA": 1122,
      "CCACATT": 1123,
      "CGTATT": 1124,
      "AAAAAAAAA": 1125,
      "CCAAATT": 1126,
      "TAATTTA": 1127,
      "CCGTA": 1128,
      "GTCTGTT": 1129,
      "TAAGTA": 1130,
      "CCACTC": 1131,
      "TATTTATT": 1132,
      "CGTTCA": 1133,
      "TGAGC": 1134,
      "TGACGA": 1135,
      "TCACTGA": 1136,
      "GGACTT": 1137,
      "TCTATG": 1138,
      "CTGTAAA": 1139,
      "CATGGG": 1140,
      "CGTCCA": 1141,
      "TCCCAA": 1142,
      "CCAGTC": 1143,
      "TCACAGA": 1144,
      "CCCGATCCATT": 1145,
      "GGAAGTTGGTTCCA": 1146,
      "TTTGAAA": 1147,
      "CCATTTT": 1148,
      "GGTGTA": 1149,
      "GTTTTAA": 1150,
      "CCTATA": 1151,
      "TCTTAAA": 1152,
      "TGACACA": 1153,
      "TCATAGAGACTT": 1154,
      "CGGAAA": 1155,
      "TAATGAA": 1156,
      "TGTTGTG": 1157,
      "CTCAAAA": 1158,
      "TGTGTTTT": 1159,
      "TCTGTC": 1160,
      "CAAGTA": 1161,
      "GCAGTC": 1162,
      "GCCCTT": 1163,
      "CAAACTG": 1164,
      "TGACATT": 1165,
      "TTACTA": 1166,
      "GAAGAAA": 1167,
      "GGAGC": 1168,
      "TCAGTCA": 1169,
      "TCTCTC": 1170,
      "CCCAGG": 1171,
      "CGGCTG": 1172,
      "GCAGAGG": 1173,
      "GTAAGA": 1174,
      "GTTTTTA": 1175,
      "GCTATA": 1176,
      "GTGCTC": 1177,
      "GCCATA": 1178,
      "CGCAGA": 1179,
      "TGAGTA": 1180,
      "GCAGCTT": 1181,
      "GTTTGTG": 1182,
      "TCACAAA": 1183,
      "CTTGTC": 1184,
      "CCAGTA": 1185,
      "GCAGAAA": 1186,
      "CAATC": 1187,
      "GCGGGG": 1188,
      "TGAAGAA": 1189,
      "GGAGCC": 1190,
      "GTGGCC": 1191,
      "TCAGTGA": 1192,
      "TGATAAA": 1193,
      "CCAACTT": 1194,
      "CCTGGG": 1195,
      "GTCGTC": 1196,
      "CTCTTA": 1197,
      "CTCTGCA": 1198,
      "GTGTGTGTGTGTGTGTGTG": 1199,
      "CAACTA": 1200,
      "GCTCAAA": 1201,
      "CGTGCGTG": 1202,
      "TCATGTT": 1203,
      "GTTAGA": 1204,
      "GCGATG": 1205,
      "CTGCAGA": 1206,
      "CTTTATT": 1207,
      "GAAATAA": 1208,
      "CGTTTA": 1209,
      "TGTGTC": 1210,
      "GTCCTA": 1211,
      "GTTAAAA": 1212,
      "GAAGTA": 1213,
      "GGAAGG": 1214,
      "CTGTATA": 1215,
      "CTCTGTT": 1216,
      "CTCCTCA": 1217,
      "GAAATGA": 1218,
      "GGTGGG": 1219,
      "TAACAAA": 1220,
      "GGTGAAA": 1221,
      "GTGCCA": 1222,
      "TAAGCA": 1223,
      "CTTTCTT": 1224,
      "GTTTTCA": 1225,
      "GTTTTTG": 1226,
      "CCTACA": 1227,
      "GACACA": 1228,
      "TTAGGA": 1229,
      "GAGGTA": 1230,
      "TAAATCA": 1231,
      "TAACATT": 1232,
      "TTATTCA": 1233,
      "TTTTTCA": 1234,
      "TAATTTG": 1235,
      "CCTTGG": 1236,
      "TGATGTT": 1237,
      "TTACACA": 1238,
      "CGGAGG": 1239,
      "GCGACA": 1240,
      "GCCCCA": 1241,
      "CCCATA": 1242,
      "CCTATT": 1243,
      "CCTCAAA": 1244,
      "GGTTGA": 1245,
      "CTTTAAA": 1246,
      "CGCGA": 1247,
      "GCGGCA": 1248,
      "GCTGATG": 1249,
      "CTGTTTG": 1250,
      "TTATGTT": 1251,
      "GTTTAAA": 1252,
      "CGCTCA": 1253,
      "GAATAAA": 1254,
      "TCTGTGA": 1255,
      "GTAGGA": 1256,
      "GAAAGAAA": 1257,
      "TAACACA": 1258,
      "CTGCACA": 1259,
      "CTTTGTT": 1260,
      "TAAAAAAAA": 1261,
      "GCGTGA": 1262,
      "GTAAATG": 1263,
      "GCTCATT": 1264,
      "GTGTGAA": 1265,
      "GTTTCTT": 1266,
      "GCTGCTC": 1267,
      "TTATAAA": 1268,
      "GTCTGAA": 1269,
      "GTGAATT": 1270,
      "CAACTC": 1271,
      "TGTGTGTT": 1272,
      "TATTTGA": 1273,
      "CAATAAA": 1274,
      "TCATTTA": 1275,
      "GTACTG": 1276,
      "CCACCCC": 1277,
      "CGACC": 1278,
      "CTTCTA": 1279,
      "CCAAGG": 1280,
      "CAAATGA": 1281,
      "TCTGTCA": 1282,
      "TGAAATT": 1283,
      "CTGCTA": 1284,
      "GTGGTC": 1285,
      "GCTGCAA": 1286,
      "GAGAAA": 1287,
      "TCATCTT": 1288,
      "GGACC": 1289,
      "CTCTCTT": 1290,
      "GTTTATT": 1291,
      "CAAAGTG": 1292,
      "GATGGG": 1293,
      "ATT": 1294,
      "GTTTGAA": 1295,
      "TAATGTG": 1296,
      "GTATC": 1297,
      "TTTTAATT": 1298,
      "GTCTTA": 1299,
      "CTAAATT": 1300,
      "GCCTTTT": 1301,
      "CTTGCA": 1302,
      "CTAAATG": 1303,
      "TGAGAAA": 1304,
      "CGGACA": 1305,
      "GTTAATT": 1306,
      "CCCATG": 1307,
      "TCAAATA": 1308,
      "GAACAAA": 1309,
      "TGTAGA": 1310,
      "CTGAATG": 1311,
      "CTGCTGA": 1312,
      "GCAGTGA": 1313,
      "GCAAACA": 1314,
      "GGAGTG": 1315,
      "TCAGCTG": 1316,
      "GTCTCTG": 1317,
      "CGGAGA": 1318,
      "CCATCCC": 1319,
      "TCCTTA": 1320,
      "GATATTTT": 1321,
      "CTGTGAA": 1322,
      "TATGGG": 1323,
      "TCATTTG": 1324,
      "GTAAATT": 1325,
      "GGACGA": 1326,
      "GATGAAAA": 1327,
      "GCACAAA": 1328,
      "CGCCTT": 1329,
      "TCCTCAA": 1330,
      "GAAAAGA": 1331,
      "GATAGA": 1332,
      "TAATTCA": 1333,
      "CAACATT": 1334,
      "TTACAAA": 1335,
      "TTTAGA": 1336,
      "TGACTA": 1337,
      "GGAGAGA": 1338,
      "CGTGTA": 1339,
      "TGACGG": 1340,
      "CTCTGAA": 1341,
      "CTCCACA": 1342,
      "GCTTGG": 1343,
      "CTCCTA": 1344,
      "CTGGTC": 1345,
      "TAATATA": 1346,
      "TCCATCCA": 1347,
      "TCAGAAA": 1348,
      "TGACAGA": 1349,
      "TGACTGA": 1350,
      "GAAGCC": 1351,
      "CTTAATT": 1352,
      "TAATATG": 1353,
      "TCCTTTT": 1354,
      "TAAAAGA": 1355,
      "CTCCGA": 1356,
      "AAAAGG": 1357,
      "GCTGCC": 1358,
      "CTTTTTG": 1359,
      "TTTTTTA": 1360,
      "TGACCTT": 1361,
      "CTCGTC": 1362,
      "CAAGTC": 1363,
      "CTTTTAA": 1364,
      "TGATTTG": 1365,
      "CTGAACA": 1366,
      "GCTGATT": 1367,
      "GAGGGAGG": 1368,
      "GCAAGG": 1369,
      "TCATTAA": 1370,
      "GCAGGAA": 1371,
      "GTGAATG": 1372,
      "TTTTCTG": 1373,
      "GCACACA": 1374,
      "TCAGAGA": 1375,
      "CTACACA": 1376,
      "TGAGAGA": 1377,
      "TCTCCC": 1378,
      "TATTGTG": 1379,
      "CCAAACA": 1380,
      "TTAGTA": 1381,
      "CTGCAGG": 1382,
      "CTTTTCA": 1383,
      "TGATTTA": 1384,
      "TACATTTT": 1385,
      "GGAGAAA": 1386,
      "CGTGGA": 1387,
      "CAACATG": 1388,
      "GTCAGTG": 1389,
      "TAAAGAA": 1390,
      "TGATGTG": 1391,
      "GTCTTTG": 1392,
      "CCACTGA": 1393,
      "CTCTAA": 1394,
      "GGAAATG": 1395,
      "TCCTAA": 1396,
      "CTACC": 1397,
      "CCACCAAA": 1398,
      "TCTGATG": 1399,
      "GGACTG": 1400,
      "GGGGGA": 1401,
      "GCAAATG": 1402,
      "TGTTTGTT": 1403,
      "GTGGAAA": 1404,
      "CGGATG": 1405,
      "TCACTCA": 1406,
      "CAATAACTTTTTT": 1407,
      "CCACAAA": 1408,
      "GTAGCA": 1409,
      "CACACACACACACA": 1410,
      "CTTCACA": 1411,
      "TCATAAA": 1412,
      "CTTAAAA": 1413,
      "GCTAAAA": 1414,
      "TGAGTGA": 1415,
      "TAATCAA": 1416,
      "GCTGACA": 1417,
      "CGCATT": 1418,
      "CGACGA": 1419,
      "TCATATT": 1420,
      "CGGTC": 1421,
      "GGGGAAA": 1422,
      "CTTCCTG": 1423,
      "GCAAATT": 1424,
      "GGACCA": 1425,
      "CAATTTT": 1426,
      "CCACACA": 1427,
      "TATATTTT": 1428,
      "GTAGTG": 1429,
      "CTGCTCA": 1430,
      "GAGGAGG": 1431,
      "TATATACA": 1432,
      "GCGGTT": 1433,
      "CTAGTT": 1434,
      "CCGTCA": 1435,
      "CTGTATT": 1436,
      "TTAAGA": 1437,
      "TCTTGTT": 1438,
      "TGTTGAA": 1439,
      "CAACAGA": 1440,
      "GGGGCA": 1441,
      "CCACAGA": 1442,
      "TAAATTA": 1443,
      "TCAGAGG": 1444,
      "GCCAAAA": 1445,
      "GGATTA": 1446,
      "TCACATG": 1447,
      "CGCATG": 1448,
      "CTCTTCA": 1449,
      "GCGCTT": 1450,
      "TGTTTC": 1451,
      "CAAAGAA": 1452,
      "GTAAATA": 1453,
      "TCAGATT": 1454,
      "CGAGTG": 1455,
      "CGTACA": 1456,
      "CGGGGA": 1457,
      "GCAGCAA": 1458,
      "CATTTAA": 1459,
      "TTTTGTG": 1460,
      "GCAGCTC": 1461,
      "CGCAGG": 1462,
      "GCCTCTG": 1463,
      "CTTTGTG": 1464,
      "GGGAGGA": 1465,
      "CCGCTG": 1466,
      "CACAGAA": 1467,
      "TCATTCA": 1468,
      "TTAGTC": 1469,
      "TCTCCACTAATGTG": 1470,
      "TGACTCA": 1471,
      "TGAGGAA": 1472,
      "CTGTCTG": 1473,
      "GACAGAA": 1474,
      "TATTTC": 1475,
      "TCATCAA": 1476,
      "CCATAA": 1477,
      "GGTTGG": 1478,
      "TCAGCTT": 1479,
      "CCCCCC": 1480,
      "TCGTCA": 1481,
      "CCACATG": 1482,
      "GCGCTC": 1483,
      "CCTCCC": 1484,
      "TTACTC": 1485,
      "CGACTG": 1486,
      "CGGCTC": 1487,
      "CACAGTG": 1488,
      "CCAGCTG": 1489,
      "CGCACGCA": 1490,
      "GCCGTG": 1491,
      "GTAAACA": 1492,
      "CATTTC": 1493,
      "CTGAAGG": 1494,
      "TATTGTA": 1495,
      "CACACTG": 1496,
      "GAAGGGG": 1497,
      "CATTGTT": 1498,
      "CCACGA": 1499,
      "TTATTGA": 1500,
      "CAAACC": 1501,
      "TCTCTCTG": 1502,
      "GCCCAA": 1503,
      "CGGATT": 1504,
      "TCAACAA": 1505,
      "GTCTGCA": 1506,
      "TACAGTG": 1507,
      "TCATCTG": 1508,
      "TGATTAA": 1509,
      "TAAAGTG": 1510,
      "GCCTCTT": 1511,
      "TGAGTCA": 1512,
      "GCACATG": 1513,
      "TATTGAA": 1514,
      "TGTGGTT": 1515,
      "CAAAAGA": 1516,
      "GTTATTCA": 1517,
      "TCAGACA": 1518,
      "CTCTTTG": 1519,
      "CTAGAA": 1520,
      "TTTTGAA": 1521,
      "GTATTTA": 1522,
      "TCCGTC": 1523,
      "TCACGA": 1524,
      "TAAGAAA": 1525,
      "GCGGCC": 1526,
      "CGAGCTTCTACGA": 1527,
      "CGAACA": 1528,
      "GTCGGA": 1529,
      "CTTCATT": 1530,
      "GTCCGA": 1531,
      "TTATGAA": 1532,
      "TTAGCC": 1533,
      "GATTGG": 1534,
      "TGAAATA": 1535,
      "GAAAAGG": 1536,
      "CCACGG": 1537,
      "TCCTCCA": 1538,
      "TAAAGTT": 1539,
      "CTGAGGA": 1540,
      "CTGGTA": 1541,
      "GCAGATG": 1542,
      "CTTTTTA": 1543,
      "CTAAGA": 1544,
      "CTTTGAA": 1545,
      "TAATGTA": 1546,
      "TTATATA": 1547,
      "CCTTAAA": 1548,
      "GCAGACA": 1549,
      "TTTTCC": 1550,
      "CCAGAGA": 1551,
      "TCCCAAA": 1552,
      "CTGAATA": 1553,
      "GGGGGGGGGGGGGGGG": 1554,
      "GTTTCTG": 1555,
      "TTACAGA": 1556,
      "CAAATAA": 1557,
      "GCGCCA": 1558,
      "GTGGAGG": 1559,
      "TTTTTC": 1560,
      "GTCTAA": 1561,
      "TTATCTT": 1562,
      "TGTGCTG": 1563,
      "GTTCACA": 1564,
      "GCTCCTC": 1565,
      "GTCTCTT": 1566,
      "GTGAGGA": 1567,
      "GTTGCC": 1568,
      "GCTCAGA": 1569,
      "TGAAGGA": 1570,
      "TGATTCA": 1571,
      "GTATTTG": 1572,
      "GTACC": 1573,
      "CCCCCCCCCCCCCCCC": 1574,
      "TTTTAAAA": 1575,
      "TTTTCTC": 1576,
      "GCACAGA": 1577,
      "CTATCA": 1578,
      "TCTGCC": 1579,
      "CGAGAA": 1580,
      "GTTAATG": 1581,
      "GTCTGGA": 1582,
      "GTGGAGA": 1583,
      "CGAGCA": 1584,
      "CTACCA": 1585,
      "GGAAACA": 1586,
      "GTTTTGA": 1587,
      "GTGTTTA": 1588,
      "TGTTTAA": 1589,
      "CGAATG": 1590,
      "CGGTGA": 1591,
      "CCTCGG": 1592,
      "GTTTCTC": 1593,
      "CTGGCC": 1594,
      "GGAAATT": 1595,
      "TCTTTCTT": 1596,
      "TGAAACA": 1597,
      "TATTCAA": 1598,
      "TCTGATT": 1599,
      "CTGTTTA": 1600,
      "TTAGAAA": 1601,
      "TCATGTG": 1602,
      "GTGCAGA": 1603,
      "GCTCACA": 1604,
      "GCGATT": 1605,
      "TGAGCTT": 1606,
      "CTGCATT": 1607,
      "TCACAGG": 1608,
      "GTGTCTG": 1609,
      "CAAACCA": 1610,
      "CGACAA": 1611,
      "GTCTTCA": 1612,
      "CTACATT": 1613,
      "CTTAGA": 1614,
      "CTGTACA": 1615,
      "TCCTGTT": 1616,
      "GTGTAAA": 1617,
      "TCAATGA": 1618,
      "CACAGCA": 1619,
      "GCAACAA": 1620,
      "TGTTCC": 1621,
      "TTTTCCA": 1622,
      "GTCTCTC": 1623,
      "TCATGAA": 1624,
      "CTGTCTT": 1625,
      "TTTTCAA": 1626,
      "TTTGGG": 1627,
      "TCTAGA": 1628,
      "TGAGCTG": 1629,
      "CTCTGGA": 1630,
      "CCAAATG": 1631,
      "TGATGCA": 1632,
      "GCAAGCAGC": 1633,
      "CTATC": 1634,
      "TCTGCTT": 1635,
      "GCAGATT": 1636,
      "TAAAAATG": 1637,
      "CTGCGG": 1638,
      "CTCTCCA": 1639,
      "TTAGGGTTAGGGTTAGG": 1640,
      "GTGAACA": 1641,
      "CGTTGA": 1642,
      "GAAGAGA": 1643,
      "GTCCAGA": 1644,
      "TATTTAAA": 1645,
      "CTTCCTC": 1646,
      "GAGGAGA": 1647,
      "GGTTAAA": 1648,
      "GAACACA": 1649,
      "CAAAAATA": 1650,
      "TCTAAAA": 1651,
      "TAATTAAA": 1652,
      "TCCCTA": 1653,
      "CTTCAAA": 1654,
      "CTGTGCA": 1655,
      "TAAAAATA": 1656,
      "CTCCAGA": 1657,
      "GTTCTA": 1658,
      "GTCCAAA": 1659,
      "GCCTGTG": 1660,
      "GTCCTCA": 1661,
      "TCGCTG": 1662,
      "GTCCACA": 1663,
      "CCAATGGA": 1664,
      "CTTTCTC": 1665,
      "TCCTTAA": 1666,
      "GTGGTGA": 1667,
      "TAAAAACA": 1668,
      "GCGTTA": 1669,
      "CTGCAAA": 1670,
      "GTGTCTT": 1671,
      "CTCCGG": 1672,
      "GCACTGA": 1673,
      "GGTGAA": 1674,
      "GAAAAAAAA": 1675,
      "TACACAA": 1676,
      "GCCCGA": 1677,
      "TATTTATA": 1678,
      "TGGGAAA": 1679,
      "CTGTGTC": 1680,
      "TATTAAAA": 1681,
      "GCCCGG": 1682,
      "CACACAAA": 1683,
      "TCCACC": 1684,
      "TGATGGA": 1685,
      "CTTCTCA": 1686,
      "TCCTTTG": 1687,
      "TGTTTGTG": 1688,
      "GAGAGAGG": 1689,
      "GAGAGAAA": 1690,
      "CCCGATCCATTGGTA": 1691,
      "TCTCATT": 1692,
      "CACACAGA": 1693,
      "TCAATAA": 1694,
      "TGACATG": 1695,
      "TCTGCTC": 1696,
      "GCGAAA": 1697,
      "TTTTTCTT": 1698,
      "CTAAATA": 1699,
      "GTTCAAA": 1700,
      "CTACAAA": 1701,
      "CTCACTCA": 1702,
      "GCAGCCA": 1703,
      "CTGTCTC": 1704,
      "CTGTTCA": 1705,
      "GGAGCTG": 1706,
      "GGATC": 1707,
      "GCGGGA": 1708,
      "TTTTCATT": 1709,
      "CTGAAGA": 1710,
      "GTTCATT": 1711,
      "ACA": 1712,
      "GTCTCCA": 1713,
      "GCATAA": 1714,
      "GCCTCCA": 1715,
      "GTCAATG": 1716,
      "CAATGAA": 1717,
      "GGGTG": 1718,
      "GATGGATG": 1719,
      "CTGCGA": 1720,
      "TCTTGAA": 1721,
      "TACAGAA": 1722,
      "CTGTTGA": 1723,
      "TCATCTC": 1724,
      "GTTGTCA": 1725,
      "CCAGAAA": 1726,
      "CTCACC": 1727,
      "TGTTGTA": 1728,
      "GTTTCCA": 1729,
      "CTGCATG": 1730,
      "GGAGAGG": 1731,
      "TCATCCA": 1732,
      "GTCAACA": 1733,
      "GTCAATT": 1734,
      "GCACTC": 1735,
      "CTGAGAA": 1736,
      "ATG": 1737,
      "CGATGA": 1738,
      "GGACACA": 1739,
      "TGTTCTT": 1740,
      "TAATGCA": 1741,
      "TTATCAA": 1742,
      "TCACCTT": 1743,
      "TTATTATT": 1744,
      "CCTCTGA": 1745,
      "CTCAACA": 1746,
      "CCAGTGA": 1747,
      "TTTTTTTG": 1748,
      "CAGACAA": 1749,
      "TCTTTTTT": 1750,
      "CATAGA": 1751,
      "GGGCC": 1752,
      "TCACGG": 1753,
      "GTGTTGA": 1754,
      "CTGGAAA": 1755,
      "TCAAAGA": 1756,
      "CCAGAGG": 1757,
      "TGATATT": 1758,
      "CATTTAAA": 1759,
      "GTGTTAA": 1760,
      "TACAGTT": 1761,
      "CCATCTT": 1762,
      "TCCAAAA": 1763,
      "CAATGTG": 1764,
      "GCAAATA": 1765,
      "GGAGGGG": 1766,
      "GAATGAA": 1767,
      "GTAAGG": 1768,
      "GCCTCTC": 1769,
      "TCCGAA": 1770,
      "TAACATG": 1771,
      "CTTCCTT": 1772,
      "CTGAAAAA": 1773,
      "GGACAAA": 1774,
      "GTTTTAAA": 1775,
      "GTTGAAA": 1776,
      "GCATGTT": 1777,
      "CCTGCTC": 1778,
      "GTAGAAA": 1779,
      "GGATTTT": 1780,
      "GAAGTC": 1781,
      "TTACTGA": 1782,
      "TGATTGA": 1783,
      "GGAGGAGGAGGA": 1784,
      "GCTGTGA": 1785,
      "GTTTCAA": 1786,
      "CCCCAAA": 1787,
      "GCATGTG": 1788,
      "GCAGGTT": 1789,
      "GCGGAA": 1790,
      "CTACAGA": 1791,
      "TCCTTCA": 1792,
      "CCAACAA": 1793,
      "GCATTTA": 1794,
      "CATTGTG": 1795,
      "CAAAAACA": 1796,
      "TAACAGA": 1797,
      "GTCGTG": 1798,
      "GGACAGA": 1799,
      "TGTGTGTGTGTGTG": 1800,
      "CACACC": 1801,
      "CTGACC": 1802,
      "CTAGTG": 1803,
      "TTTTTATT": 1804,
      "GTTCAGA": 1805,
      "TTAGATT": 1806,
      "TAAAGTA": 1807,
      "CTGGAGA": 1808,
      "AAAACAA": 1809,
      "TGTAGG": 1810,
      "GCCTGAA": 1811,
      "TCTTCTC": 1812,
      "TCAGATG": 1813,
      "TTTTGTA": 1814,
      "TTATGTG": 1815,
      "CTCAATT": 1816,
      "GTTTGCA": 1817,
      "CCACACC": 1818,
      "TGAACAA": 1819,
      "GACACAA": 1820,
      "GTGAAGA": 1821,
      "GGAAATA": 1822,
      "TCAGGTT": 1823,
      "TTATTAAA": 1824,
      "GCATTTG": 1825,
      "CCTCCCTC": 1826,
      "CCTTTAA": 1827,
      "TCAGGAA": 1828,
      "TTTTTTTTTT": 1829,
      "GTGAGAA": 1830,
      "CTGATGA": 1831,
      "CCATGTT": 1832,
      "CATGTGA": 1833,
      "CTCACACA": 1834,
      "GCTGAGG": 1835,
      "CTCCTCCTCCTC": 1836,
      "TTTTTTTA": 1837,
      "TATAGG": 1838,
      "CATGTC": 1839,
      "TAAAAGG": 1840,
      "CTAAACA": 1841,
      "CGCCCA": 1842,
      "GCACGG": 1843,
      "GGATGAA": 1844,
      "GTGTTCA": 1845,
      "GGACGG": 1846,
      "GCCTGCA": 1847,
      "CCTGCC": 1848,
      "TAATCTT": 1849,
      "CTGTGGA": 1850,
      "CAAACTT": 1851,
      "GCAGGTG": 1852,
      "GAACAGA": 1853,
      "GAAGGAA": 1854,
      "GTAGAGA": 1855,
      "CTGACAA": 1856,
      "GTCTTTA": 1857,
      "GCTTAAA": 1858,
      "CAAATAAA": 1859,
      "CTGTCAA": 1860,
      "TGTGTTTG": 1861,
      "TCTCTGA": 1862,
      "TCTGTTTT": 1863,
      "CTTTTGA": 1864,
      "CTTTTAAA": 1865,
      "GCTCATG": 1866,
      "GGTTGTGA": 1867,
      "TCTCCAA": 1868,
      "GGCATA": 1869,
      "CGTATG": 1870,
      "GTTGTGA": 1871,
      "TGAGAGG": 1872,
      "TGAATGAA": 1873,
      "TCCATC": 1874,
      "GCTGAGA": 1875,
      "CTTAATG": 1876,
      "CTATAAA": 1877,
      "CTTTTCTT": 1878,
      "TCATTGA": 1879,
      "TCACCTG": 1880,
      "GCAGTCA": 1881,
      "GAAACC": 1882,
      "TCTGAAGG": 1883,
      "CTGTTAA": 1884,
      "TCTCCTT": 1885,
      "TGTTGGA": 1886,
      "TTACATG": 1887,
      "GAGACAA": 1888,
      "TAAACACA": 1889,
      "TCTCATG": 1890,
      "GAACATT": 1891,
      "GTCGTT": 1892,
      "GTACAAA": 1893,
      "TAAACC": 1894,
      "CTACTC": 1895,
      "TGAGATT": 1896,
      "CGACTT": 1897,
      "CGAGCC": 1898,
      "CAATTTG": 1899,
      "CTGTATG": 1900,
      "TCTTTAA": 1901,
      "TATATAA": 1902,
      "CAATATT": 1903,
      "GTAAAAAA": 1904,
      "GTGAGTG": 1905,
      "TCTTTTA": 1906,
      "CTCAGTG": 1907,
      "GAGAAAAA": 1908,
      "TCCGTT": 1909,
      "TCGAGCAAGCAGC": 1910,
      "CCTCGA": 1911,
      "CAAAAGG": 1912,
      "GCATGAA": 1913,
      "CCCCTA": 1914,
      "CTCGTG": 1915,
      "CCAATGGATCGG": 1916,
      "CCAGTCA": 1917,
      "TCCGTG": 1918,
      "CCAGGAA": 1919,
      "GGAGACA": 1920,
      "CTGGAGG": 1921,
      "GTGAATA": 1922,
      "CAGGCC": 1923,
      "GCATTAA": 1924,
      "CAATTAA": 1925,
      "CCATTTA": 1926,
      "CATGTTTT": 1927,
      "TATGAAAA": 1928,
      "CAAGCC": 1929,
      "GCTCGA": 1930,
      "CTCTGTC": 1931,
      "GCACTA": 1932,
      "CGAATT": 1933,
      "GGAGTC": 1934,
      "TAATTGA": 1935,
      "GGATCA": 1936,
      "TAACTGA": 1937,
      "CGCACACACACACACACA": 1938,
      "CCAACTTCCAA": 1939,
      "GAGGATG": 1940,
      "TTATCTG": 1941,
      "GCTCTGA": 1942,
      "CTTCAGA": 1943,
      "CTTGATT": 1944,
      "GTTTACA": 1945,
      "GCACGA": 1946,
      "GAGGATT": 1947,
      "CCCCCTC": 1948,
      "TCTTTGA": 1949,
      "TATTTACA": 1950,
      "CCATGTG": 1951,
      "GTGGCTG": 1952,
      "GCCTGTT": 1953,
      "GTCTGTC": 1954,
      "GAAACAAA": 1955,
      "TTTTAATG": 1956,
      "CTATTTA": 1957,
      "TCTTCC": 1958,
      "TCTCTCA": 1959,
      "CATTTGA": 1960,
      "GAAGCTG": 1961,
      "GACAGAGA": 1962,
      "TTATTATTATTA": 1963,
      "CCATTTG": 1964,
      "CCTCATG": 1965,
      "CGTGTGTG": 1966,
      "GCTAGA": 1967,
      "CAATGTT": 1968,
      "GTGAAAAA": 1969,
      "TAAATATA": 1970,
      "GTGCACA": 1971,
      "GCTCCC": 1972,
      "GGATAA": 1973,
      "GGTTTG": 1974,
      "CCATCTG": 1975,
      "CCATTAA": 1976,
      "GCAGGGG": 1977,
      "GAAGAGG": 1978,
      "GTCCTGA": 1979,
      "GCAAAGA": 1980,
      "CCATGAA": 1981,
      "CATTAAAA": 1982,
      "CAATTTA": 1983,
      "CTTTCTG": 1984,
      "TCCGC": 1985,
      "GAACTA": 1986,
      "CAGGTGA": 1987,
      "CTTTGCA": 1988,
      "CTTTTGTT": 1989,
      "GTATGAA": 1990,
      "TCTGACA": 1991,
      "TCTTTCA": 1992,
      "CTCACTG": 1993,
      "GTGTGTA": 1994,
      "TCTTGTA": 1995,
      "GCCTTCA": 1996,
      "TAATCTG": 1997,
      "GTGCTGA": 1998,
      "TCCATCA": 1999,
      "CGACGG": 2000,
      "GCATCTG": 2001,
      "CCAAATA": 2002,
      "CGAAGA": 2003,
      "GACATTTT": 2004,
      "GTGAGTGA": 2005,
      "CGTTGG": 2006,
      "CTCCAAA": 2007,
      "TCTCTGTG": 2008,
      "TGAATGA": 2009,
      "CAAGAAA": 2010,
      "GTACATT": 2011,
      "GTCTGTA": 2012,
      "GTACACA": 2013,
      "CTGTTGG": 2014,
      "GTTTGGA": 2015,
      "CGTCTA": 2016,
      "GTTGATT": 2017,
      "GTTAGGGTTAGG": 2018,
      "CTGACTG": 2019,
      "GTATTAA": 2020,
      "CCTGTC": 2021,
      "TCCTTTA": 2022,
      "TTAGCTT": 2023,
      "GTTGCTG": 2024,
      "GTTTTGG": 2025,
      "TAATAATAATAA": 2026,
      "CTCTGTA": 2027,
      "TTTTTTAAA": 2028,
      "TCCCTAA": 2029,
      "CCACAGG": 2030,
      "TCAGTAA": 2031,
      "TTTTTTAA": 2032,
      "CTTTACA": 2033,
      "CCATAAA": 2034,
      "GAGGAAAA": 2035,
      "CCGTGA": 2036,
      "CAGACACA": 2037,
      "GTAAAGA": 2038,
      "GTCCGG": 2039,
      "GCTAATT": 2040,
      "GGTCGTAGAA": 2041,
      "CTTGAAA": 2042,
      "GAAAAACA": 2043,
      "TTACTCA": 2044,
      "TCAAAGG": 2045,
      "CCATTCA": 2046,
      "CGTGGG": 2047,
      "CCATCAA": 2048,
      "CCTTCGG": 2049,
      "CCCTAACCCTAACCCTAA": 2050,
      "CATGCTG": 2051,
      "CCTCCTT": 2052,
      "GATGGAA": 2053,
      "TCAGCAA": 2054,
      "GTAGCC": 2055,
      "TTTTTAAA": 2056,
      "GCATCTT": 2057,
      "GCTGTC": 2058,
      "GGACTC": 2059,
      "GTGTGCA": 2060,
      "CCACCAA": 2061,
      "GAAAAAAAGTTATT": 2062,
      "GTATAAA": 2063,
      "GGCCGA": 2064,
      "TAATACA": 2065,
      "GATAGATAGATAGATA": 2066,
      "CAACGA": 2067,
      "GAAAAATG": 2068,
      "TTTTCTA": 2069,
      "CAAAAATG": 2070,
      "TATTTGTT": 2071,
      "CCTCCTG": 2072,
      "GAGGGAA": 2073,
      "GTTAACA": 2074,
      "TCAGCCA": 2075,
      "TAATAAAA": 2076,
      "GCGACC": 2077,
      "GTGCAAA": 2078,
      "GTCAGAA": 2079,
      "GCATCAA": 2080,
      "TGAGACA": 2081,
      "GTGCTA": 2082,
      "TGACAGG": 2083,
      "GCAGTAA": 2084,
      "TCCTGCA": 2085,
      "GTTAAAAA": 2086,
      "CTCCTGA": 2087,
      "CATGAAAA": 2088,
      "GAGGACA": 2089,
      "TCTATCTATCTATCTA": 2090,
      "CTCAATG": 2091,
      "GATTTAA": 2092,
      "GTATGTG": 2093,
      "CCAGCTT": 2094,
      "GTCGCC": 2095,
      "CCGAGG": 2096,
      "CGTAAAA": 2097,
      "GTACAGA": 2098,
      "CTCTTTA": 2099,
      "GTCACAA": 2100,
      "TATATTA": 2101,
      "CAAAGTT": 2102,
      "TATGTTTT": 2103,
      "CCACTCA": 2104,
      "TAAATC": 2105,
      "GCCTTTG": 2106,
      "TGTGAAAA": 2107,
      "GCACATA": 2108,
      "CCTTCTT": 2109,
      "CAAAACAA": 2110,
      "GTGATGA": 2111,
      "CTGTGTA": 2112,
      "GCATTCA": 2113,
      "TAAATGAA": 2114,
      "CCCGC": 2115,
      "CAAACTA": 2116,
      "CATGTCA": 2117,
      "TCTCTCTT": 2118,
      "CGACTC": 2119,
      "GAATTTT": 2120,
      "GCGTAA": 2121,
      "GTTAATA": 2122,
      "CCGACA": 2123,
      "TGTGTCA": 2124,
      "CCAGACA": 2125,
      "CCACCTG": 2126,
      "CACAGTT": 2127,
      "GTGGGGG": 2128,
      "GAATATT": 2129,
      "CATTCATT": 2130,
      "TCTTATT": 2131,
      "TCTCCTG": 2132,
      "GTGTGGA": 2133,
      "GTGTGTC": 2134,
      "CACATTA": 2135,
      "TGAGATG": 2136,
      "TCCAGGA": 2137,
      "GCTTATT": 2138,
      "TGAGGTT": 2139,
      "GTTGCTT": 2140,
      "TCTGATA": 2141,
      "GCCGGA": 2142,
      "CTATTTG": 2143,
      "CGGCGA": 2144,
      "CAATCAA": 2145,
      "CACACTT": 2146,
      "GAATTTA": 2147,
      "TAAACTT": 2148,
      "CTAAGG": 2149,
      "GTGCATT": 2150,
      "CACAGGA": 2151,
      "GTTTGTA": 2152,
      "TGATTGG": 2153,
      "TCACATA": 2154,
      "TAAACTG": 2155,
      "CTCCAGG": 2156,
      "CTCACTT": 2157,
      "TCTGAGA": 2158,
      "CCCCGG": 2159,
      "TCGATT": 2160,
      "TTATACA": 2161,
      "TAAACAAA": 2162,
      "TAAAGGA": 2163,
      "GTGCAGG": 2164,
      "CCAACTTCCAAGTCTCTA": 2165,
      "GCCGTC": 2166,
      "GTTGTTTT": 2167,
      "GTGGATT": 2168,
      "GCGATA": 2169,
      "GTTCCTG": 2170,
      "GTATATT": 2171,
      "TCTGAAAA": 2172,
      "GAGAATT": 2173,
      "CCAAAGA": 2174,
      "TCTCAGA": 2175,
      "GAAGTGA": 2176,
      "GAAGAATA": 2177,
      "TCATTAAA": 2178,
      "CACACACACACACACACA": 2179,
      "TCCACTG": 2180,
      "GCGCAA": 2181,
      "GAGGAGGA": 2182,
      "CACATTTT": 2183,
      "TGAACC": 2184,
      "TGTGCC": 2185,
      "CCTTCC": 2186,
      "GCTGATA": 2187,
      "TAAATATT": 2188,
      "GAGAACA": 2189,
      "TTTTAAAAA": 2190,
      "TCAGCTC": 2191,
      "CTCCCTG": 2192,
      "TCATGCA": 2193,
      "GAGACAGA": 2194,
      "TTAAGG": 2195,
      "TGTGTGTA": 2196,
      "GCT": 2197,
      "CTGACTGA": 2198,
      "TAAATGTT": 2199,
      "TCCACTT": 2200,
      "GTTTGTC": 2201,
      "CCCCGA": 2202,
      "TCAATCAA": 2203,
      "GTGTATT": 2204,
      "GTGAAGG": 2205,
      "GAGAAGA": 2206,
      "ATA": 2207,
      "GTCCAGG": 2208,
      "GACAGGA": 2209,
